In [3]:
import pandas as pd
import numpy as np

In [4]:
obj = pd.Series(np.arange(5.), index=["a", "b", "c", "d", "e"])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [6]:
obj.drop('c')#not in plcae, returns a new series

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [7]:
obj.drop(['d','c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [9]:
data = pd.DataFrame(
                        np.arange(16).reshape((4, 4)),                    
                        index=["Ohio", "Colorado", "Utah", "New York"],
                        columns=["one", "two", "three", "four"]
                    )
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [10]:
data.drop(['Colorado','Ohio'])#deleting rows by lables

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [11]:
data.drop(columns=['two'])#deleting columns using columns keyword

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [12]:
data.drop(['one','two'],axis=1)#deleting columns using axis like numpy

          three  four
Ohio          2     3
Colorado      6     7
Utah         10    11
New York     14    15

 Indexing, Selection, and Filtering

In [13]:
obj = pd.Series(np.arange(4.), index=["a", "b", "c", "d"])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [20]:
#like numpy series can be indexed can be by using integers and also lables, series can be sliced
print(obj['a'])#indexing by label
print(obj[2])#indexing by position
print(obj['a':'c'])#slicing by lables
print(obj[0:2])#slicing by positions
print(obj[['a','d','c']])#arbitary selection

0.0
2.0
a    0.0
b    1.0
c    2.0
dtype: float64
a    0.0
b    1.0
dtype: float64
a    0.0
d    3.0
c    2.0
dtype: float64

C:\Users\chall\AppData\Local\Temp\ipykernel_8136\1467065493.py:3: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(obj[2])#indexing by position

In [21]:
obj[obj<2]#boolean indexing

a    0.0
b    1.0
dtype: float64

In [22]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [23]:
obj[['b','c','a']]

b    1.0
c    2.0
a    0.0
dtype: float64

In [24]:
#normal selection [] can be use index with position when the index is strings we can slice/index with normal selection [] with position
obj1 = pd.Series([1, 2, 3], index=[2, 0, 1])
obj2 = pd.Series([1, 2, 3], index=["a", "b", "c"])

In [26]:
obj1[[0,1,2]]

0    2
1    3
2    1
dtype: int64

In [28]:
obj2[[0, 1, 2]]#indices are lables but can be indexed with position with normal selection []

C:\Users\chall\AppData\Local\Temp\ipykernel_8136\977625574.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  obj2[[0, 1, 2]]#indices are lables but can be indexed with position with normal selection []

a    1
b    2
c    3
dtype: int64

In [29]:
#when using loc() we cannot index with integers when indexes are strings
#fro loc() we should pass the exact type of indexes of the series
#otherwise error will rise

In [31]:
obj2

a    1
b    2
c    3
dtype: int64

In [32]:
obj.loc([0,2,1])#since the indexes are strings we cannot index with position/integers

TypeError: unhashable type: 'list'

In [36]:
obj2

a    1
b    2
c    3
dtype: int64

In [39]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [41]:
obj2.loc['b']

2

In [42]:
obj.loc['b':'d']

b    1.0
c    2.0
d    3.0
dtype: float64

In [43]:
obj.loc[['a','d','c']]

a    0.0
d    3.0
c    2.0
dtype: float64

In [44]:
#even though the indices are trings we can slice/index by position with iloc()

In [45]:
obj2.iloc[[0, 1, 2]]

a    1
b    2
c    3
dtype: int64

In [47]:
obj2.iloc[0::2]

a    1
c    3
dtype: int64

In [48]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),                    
index=["Ohio", "Colorado", "Utah", "New York"],
 columns=["one", "two", "three", "four"])

In [49]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [51]:
data["two"]

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [52]:
data[["three", "one"]]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [53]:
data[:2]#rows

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [54]:
data[data["three"] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [55]:
data.loc[["Colorado", "New York"]]

          one  two  three  four
Colorado    4    5      6     7
New York   12   13     14    15

In [56]:
data.loc["Colorado", ["two", "three"]]

two      5
three    6
Name: Colorado, dtype: int32

In [57]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [60]:
data.loc['Ohio':'Utah']

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11

In [63]:
data.loc['Ohio':'Utah',['one','three']]
#loc(rows,columns)
#for slicing no need of selection braces

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10

In [64]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [65]:
#iloc(rows,columns)
#for slicing no need of selection []

In [66]:
data.iloc[2]#roww selection

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [67]:
data.iloc[[2,0]]

      one  two  three  four
Utah    8    9     10    11
Ohio    0    1      2     3

In [68]:
data.iloc[[2,3],[0,2]]
#2,3 rows
#0,2 columns

          one  three
Utah        8     10
New York   12     14

In [69]:
data.iloc[:,:]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [70]:
data.iloc[2:,[2,1]]

          three  two
Utah         10    9
New York     14   13